panStamp/panstamp/arduino-1.5/arduino-1.5_patch/lin/tools/msp430/msp430/include/msp430f2618.h
#define CAL_ADC_25T85          (0x0007)  /* Index for 2.5V/85Deg Cal. Value */
#define CAL_ADC_25T30          (0x0006)  /* Index for 2.5V/30Deg Cal. Value */
#define CAL_ADC_25VREF_FACTOR  (0x0005)  /* Index for 2.5V Ref. Factor */
#define CAL_ADC_15T85          (0x0004)  /* Index for 1.5V/85Deg Cal. Value */
#define CAL_ADC_15T30          (0x0003)  /* Index for 1.5V/30Deg Cal. Value */
#define CAL_ADC_15VREF_FACTOR  (0x0002)  /* Index for ADC 1.5V Ref. Factor */
#define CAL_ADC_OFFSET         (0x0001)  /* Index for ADC Offset */
#define CAL_ADC_GAIN_FACTOR    (0x0000)  /* Index for ADC Gain Factor */

#define CAL_DCO_16MHZ          (0x0000)  /* Index for DCOCTL  Calibration Data for 16MHz */
#define CAL_BC1_16MHZ          (0x0001)  /* Index for BCSCTL1 Calibration Data for 16MHz */
#define CAL_DCO_12MHZ          (0x0002)  /* Index for DCOCTL  Calibration Data for 12MHz */
#define CAL_BC1_12MHZ          (0x0003)  /* Index for BCSCTL1 Calibration Data for 12MHz */
#define CAL_DCO_8MHZ           (0x0004)  /* Index for DCOCTL  Calibration Data for 8MHz */
#define CAL_BC1_8MHZ           (0x0005)  /* Index for BCSCTL1 Calibration Data for 8MHz */
#define CAL_DCO_1MHZ           (0x0006)  /* Index for DCOCTL  Calibration Data for 1MHz */
#define CAL_BC1_1MHZ           (0x0007)  /* Index for BCSCTL1 Calibration Data for 1MHz */


/************************************************************
* Calibration Data in Info Mem
************************************************************/

#ifndef __DisableCalData

#define CALDCO_16MHZ_         0x10F8    /* DCOCTL  Calibration Data for 16MHz */
const_sfrb(CALDCO_16MHZ, CALDCO_16MHZ_);
#define CALBC1_16MHZ_         0x10F9    /* BCSCTL1 Calibration Data for 16MHz */
const_sfrb(CALBC1_16MHZ, CALBC1_16MHZ_);
#define CALDCO_12MHZ_         0x10FA    /* DCOCTL  Calibration Data for 12MHz */
const_sfrb(CALDCO_12MHZ, CALDCO_12MHZ_);
#define CALBC1_12MHZ_         0x10FB    /* BCSCTL1 Calibration Data for 12MHz */
const_sfrb(CALBC1_12MHZ, CALBC1_12MHZ_);
#define CALDCO_8MHZ_          0x10FC    /* DCOCTL  Calibration Data for 8MHz */
const_sfrb(CALDCO_8MHZ, CALDCO_8MHZ_);
#define CALBC1_8MHZ_          0x10FD    /* BCSCTL1 Calibration Data for 8MHz */
const_sfrb(CALBC1_8MHZ, CALBC1_8MHZ_);
#define CALDCO_1MHZ_          0x10FE    /* DCOCTL  Calibration Data for 1MHz */
const_sfrb(CALDCO_1MHZ, CALDCO_1MHZ_);
#define CALBC1_1MHZ_          0x10FF    /* BCSCTL1 Calibration Data for 1MHz */
const_sfrb(CALBC1_1MHZ, CALBC1_1MHZ_);

#endif /* #ifndef __DisableCalData */

/************************************************************
* Interrupt Vectors (offset from 0xFFC0)
************************************************************/

#define RESERVED0_VECTOR    (0x0000)  /* 0xFFC0 Reserved Int. Vector 0 */
#define RESERVED1_VECTOR    (0x0002)  /* 0xFFC2 Reserved Int. Vector 1 */
#define RESERVED2_VECTOR    (0x0004)  /* 0xFFC4 Reserved Int. Vector 2 */
#define RESERVED3_VECTOR    (0x0006)  /* 0xFFC6 Reserved Int. Vector 3 */
#define RESERVED4_VECTOR    (0x0008)  /* 0xFFC8 Reserved Int. Vector 4 */
#define RESERVED5_VECTOR    (0x000A)  /* 0xFFCA Reserved Int. Vector 5 */
#define RESERVED6_VECTOR    (0x000C)  /* 0xFFCC Reserved Int. Vector 6 */
#define RESERVED7_VECTOR    (0x000E)  /* 0xFFCE Reserved Int. Vector 7 */
#define RESERVED8_VECTOR    (0x0010)  /* 0xFFD0 Reserved Int. Vector 8 */
#define RESERVED9_VECTOR    (0x0012)  /* 0xFFD2 Reserved Int. Vector 9 */
#define RESERVED10_VECTOR   (0x0014) /* 0xFFD4 Reserved Int. Vector 10 */
#define RESERVED11_VECTOR   (0x0016) /* 0xFFD6 Reserved Int. Vector 11 */
#define RESERVED12_VECTOR   (0x0018) /* 0xFFD8 Reserved Int. Vector 12 */
#define RESERVED13_VECTOR   (0x001A) /* 0xFFDA Reserved Int. Vector 13 */
#define DAC12_VECTOR        (0x001C) /* 0xFFDC DAC12 */
#define DMA_VECTOR          (0x001E) /* 0xFFDE DMA */
#define USCIAB1TX_VECTOR    (0x0020) /* 0xFFE0 USCI A1/B1 Transmit */
#define USCIAB1RX_VECTOR    (0x0022) /* 0xFFE2 USCI A1/B1 Receive */
#define PORT1_VECTOR        (0x0024) /* 0xFFE4 Port 1 */
#define PORT2_VECTOR        (0x0026) /* 0xFFE6 Port 2 */
#define RESERVED20_VECTOR   (0x0028) /* 0xFFE8 Reserved Int. Vector 20 */
#define ADC12_VECTOR        (0x002A) /* 0xFFEA ADC */
#define USCIAB0TX_VECTOR    (0x002C) /* 0xFFEC USCI A0/B0 Transmit */
#define USCIAB0RX_VECTOR    (0x002E) /* 0xFFEE USCI A0/B0 Receive */
#define TIMERA1_VECTOR      (0x0030) /* 0xFFF0 Timer A CC1-2, TA */
#define TIMERA0_VECTOR      (0x0032) /* 0xFFF2 Timer A CC0 */
#define WDT_VECTOR          (0x0034) /* 0xFFF4 Watchdog Timer */
#define COMPARATORA_VECTOR  (0x0036) /* 0xFFF6 Comparator A */
#define TIMERB1_VECTOR      (0x0038) /* 0xFFF8 Timer B CC1-6, TB */
#define TIMERB0_VECTOR      (0x003A) /* 0xFFFA Timer B CC0 */
#define NMI_VECTOR          (0x003C) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (0x003E) /* 0xFFFE Reset [Highest Priority] */

/************************************************************
* End of Modules
************************************************************/
#ifdef __cplusplus
}
#endif /* extern "C" */

#endif /* #ifndef __msp430x26x */

